In [1]:
import pandas as pd

In [2]:
data = {'Name': ['Teodosija', 'Sutton', 'Taneli', 'Ravshan', 'Ross', 'Alice', 'Bob', 'Charlie', 'David', 'Emily'],
        'Age': [26, 32, 25, 31, 28, 22, 35, 30, 40, 28],
        'Salary': [50000, 60000, 45000, 70000, 55000, 60000, 70000, 55000, 75000, 65000]}

In [3]:
df = pd.DataFrame(data)

In [4]:
selected_rows = df[df['Age']>31]

In [5]:
selected_rows

     Name  Age  Salary
1  Sutton   32   60000
6     Bob   35   70000
8   David   40   75000

In [6]:
print(selected_rows)

     Name  Age  Salary
1  Sutton   32   60000
6     Bob   35   70000
8   David   40   75000